Repository: Samestora/Penuhan
Catalog: lib/l10n/app_*.arb
Languages: id

# mainMenuEmbark
source: Embark
id: Mulai

# mainMenuSettings
source: Settings
id: Pengaturan

# mainMenuAbout
source: About
id: Tentang

# settingsMusic
source: Music
id: Musik

# settingsSfx
source: Sound Effects
id: Efek Suara

# aboutCreditsTitle
source: Credits & Appreciation
id: Kredit & Apresiasi

# aboutCreditsHeader
source: Special thanks to the creators whose amazing work made this game possible:
id: Terima kasih khusus kepada para kreator yang karya luar biasanya telah mewujudkan game ini:

# aboutMusicTitle
source: Music
id: Musik

# aboutMusicCredit
source: "Main Menu" BGM by: 甘茶の音楽工房 (Amacha Music Studio)
id: BGM "Main Menu" oleh: 甘茶の音楽工房 (Amacha Music Studio)

# aboutSfxTitle
source: Sound Effects
id: Efek Suara

# aboutSfxCredit
source: Provided by: freesfx.co.uk
id: Disediakan oleh: freesfx.co.uk

# embarkNewGame
source: New Game
id: Mulai

# embarkContinue
source: Continue
id: lanjutkan

# embarkEmpty
source: Empty
id: Kosong

# embarkLastSaved
source: Last saved: {dateTime}
id: Terakhir Disimpan: {dateTime}

# embarkLoadFromDisk
source: Load from Disk
id: Muat dari Disk

# embarkSaveToDisk
source: Save to Disk
id: Simpan ke Disk

# sunkenCitadelName
source: Sunken Citadel
id: Benteng Bawah Air

# whisperingCryptName
source: Whispering Crypts
id: Kuburan

# dragonsMawName
source: Dragon's Maw
id: Mulut Naga

# easyDifficultyName
source: Easy
id: Mudah

# normalDifficultyName
source: Normal
id: Biasa

# hardDifficultyName
source: Hard
id: Sulit

# battleAttack
source: Attack
id: Serang

# battleWin
source: Win
id: Menyerah

source: Battle Start!
id: Pertempuran Dimulai!

# battleVictory
source: VICTORY!
id: MENANG!

# battleDefeat
source: DEFEAT!
id: KALAH!

# battleContinue
source: Continue
id: Lanjutkan

# battleReturn
source: Return
id: Kembali

# battlePlayerAttacks
source: {playerName} attacks for {damage} damage!
id: {playerName} menyerang dengan {damage} damage!

# battlePlayerUsesSkill
source: {playerName} uses {skillName} for {damage} damage!
id: {playerName} menggunakan {skillName} dengan {damage} damage!

# battlePlayerHeals
source: {playerName} heals for {amount} HP!
id: {playerName} memulihkan {amount} HP!

# battleEnemyAttacks
source: {enemyName} attacks for {damage} damage!
id: {enemyName} menyerang dengan {damage} damage!

# battleEnemyUsesSkill
source: {enemyName} uses {skillName} for {damage} damage!
id: {enemyName} menggunakan {skillName} dengan {damage} damage!

# battleVictoryMessage
source: Victory! {enemyName} has been defeated!
id: Menang! {enemyName} telah dikalahkan!

# battleDefeatMessage
source: Defeat! You have been defeated...
id: Kalah! Kamu telah dikalahkan...

# battleSurrendered
source: You surrendered...
id: Kamu menyerah...

# skillSelectTitle
source: SELECT SKILL
id: PILIH SKILL

# skillCancel
source: CANCEL
id: BATAL

# skillAttack
source: ATTACK
id: SERANG

# skillCost
source: Cost: {cost} MP
id: Biaya: {cost} MP

# skillCostLabel
source: Cost
id: Biaya

source: Not enough MP
id: MP tidak cukup

# skillFireballName
source: Fireball
id: Bola Api

# skillFireballDesc
source: Launch a blazing fireball Deals 150% skill damage
id: Luncurkan bola api yang membara Memberikan 150% skill damage

# skillIceSpearName
source: Ice Spear
id: Tombak Es

# skillIceSpearDesc
source: Pierce with frozen spear Deals 120% skill damage
id: Tusuk dengan tombak beku Memberikan 120% skill damage

# skillThunderStrikeName
source: Thunder Strike
id: Sambaran Petir

# skillThunderStrikeDesc
source: Call down lightning Deals 200% skill damage
id: Panggil petir dari langit Memberikan 200% skill damage

# skillQuickStrikeName
source: Quick Strike
id: Serangan Cepat

# skillQuickStrikeDesc
source: Swift precise attack Deals 100% skill damage
id: Serangan cepat dan presisi Memberikan 100% skill damage

# skillHealingLightName
source: Healing Light
id: Cahaya Penyembuh

# skillHealingLightDesc
source: Restore your vitality Heals 30 HP
id: Pulihkan vitalitasmu Memulihkan 30 HP

# floorChoosePath
source: CHOOSE YOUR PATH
id: PILIH JALANMU

# floorMonsterDesc
source: Fight a monster and earn rewards
id: Lawan monster dan dapatkan hadiah

# floorShop
source: Shop
id: Toko

# floorShopDesc
source: Buy items with your gold
id: Beli item dengan gold

# floorRest
source: Rest
id: Istirahat

# floorRestDesc
source: Restore HP and manage inventory
id: Pulihkan HP dan kelola inventory

# floorNumber
source: FLOOR {floor}
id: LANTAI {floor}

# restingResting
source: Resting
id: Istirahat

# restingNextFloor
source: Next Floor
id: Lantai Berikutnya

# restingFinishDungeon
source: Finish Dungeon
id: Selesaikan Dungeon

# restingAttack
source: Attack
id: Serangan

# restingFloor
source: Floor
id: Lantai

# restingDungeonInfo
source: Dungeon Info
id: Info Dungeon

# restingNoItems
source: No items in inventory
id: Tidak ada item di inventory

# restingUse
source: Use
id: Gunakan

# shopTitle
source: Shop
id: Toko

# shopBuy
source: BUY
id: BELI

# shopNotEnoughGold
source: NOT ENOUGH GOLD
id: GOLD TIDAK CUKUP

# shopNextFloor
source: Next Floor
id: Lantai Berikutnya

# itemHealthPotionName
source: Health Potion
id: Ramuan Kesehatan

# itemHealthPotionDesc
source: Restores 50 HP
id: Memulihkan 50 HP

# itemSuperHealthPotionName
source: Super Health Potion
id: Ramuan Kesehatan Super

# itemSuperHealthPotionDesc
source: Restores 100 HP
id: Memulihkan 100 HP

# itemAttackScrollName
source: Attack Scroll
id: Gulungan Serangan

# itemAttackScrollDesc
source: Permanently increases Attack by 5
id: Meningkatkan Serangan secara permanen sebesar 5

# itemSkillScrollName
source: Skill Scroll
id: Gulungan Skill

# itemSkillScrollDesc
source: Permanently increases Skill by 5
id: Meningkatkan Skill secara permanen sebesar 5

# itemMpPotionName
source: MP Potion
id: Ramuan MP

# itemMpPotionDesc
source: Restores 50 MP
id: Memulihkan 50 MP

# battlePlayerRestoresMp
source: {playerName} restores {amount} MP!
id: {playerName} memulihkan {amount} MP!
